<template>
  <section>
    <app-headers h1="Привязка банковской карты"/>
    <v-alert color="success">В целях проверки корректности информации и действительности Вашей карты, сейчас будет
      временно снята сумма средств в размере 1 руб
    </v-alert>
    <p><b>Внимание!</b> Принимаются только именные карты (на карте есть Ваше имя, на обороте карты - трехзначный
      CVV-код). Не принимаются: виртуальные карты, неименные карты, карты уровня Prepaid. Карта должна принадлежать Вам,
      в противном случае, Вам будет отказано в получении займа.</p>
    <p>Для подтверждения карты, система автоматически заблокирует на балансе Вашей карты сумму 1 рубль. Заблокированная
      сумма не списывается с Вашей карты и будет разблокирована в течение нескольких суток (обычно разблокировка
      происходит сразу). Узнать заблокированную сумму можно из смс от Вашего банка, в интернет банке, позвонив по
      телефону в Ваш банк (в случае, если смс не пришло или баланс на счете Вашей карты равен 0).</p>
    <p><b>Внимание!</b> Поступление средств на карты MasterCard Сбербанка и MasterCard Промсвязьбанка может занять до
      3-х суток. Это связано с особенностью работы информационных систем банков</p>
    <app-nav
      @clickNext="clickNext"
      backPath="personal-contacts"
      toPath="mandarin-card-binding"/>
  </section>
</template>

<script>
  export default {
    name: "CardBinding",
    methods: {
      async clickNext() {
        await this.$store.dispatch('fullBinding');
        location.replace(this.$store.getters.userWebLink);
      }
    }
  }
</script>

<style scoped>

</style>
